1mm_heightFunction_3D_case/0.orig/fluid/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{

  top
  {
      type            zeroGradient;
      
  }

  back
  {
      type            zeroGradient;
  }
  
  right
  {
      type            zeroGradient;
      
  }
  
  front
  {
      type            symmetryPlane;
  }
  left
  {
      type            symmetryPlane;
  }
  bottom
  {
      type            zeroGradient;
  }
}

// ************************************************************************* //
