1mm_heightFunction_3D_case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     multiRegionPhaseChangeFlow;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         5e-3;

deltaT          1e-10;

writeControl    adjustableRunTime;

writeInterval   0.5e-3;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression on;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;
maxAlphaCo      0.5;
maxDeltaT       1e-6;
maxCapillaryNum 1e8;

libs
(
    "libpostProcess.so"
);

// functions
// {
//     energyFluxes
//     {
//         type            interfaceEnergyFluxes;
//         libs ("libpostProcess.so");

//         // Write at same frequency as fields
//         writeControl    timeStep;
//         writeInterval   1;
//         region fluid;
//     }

//     surfaces
//     {
//         type            surfaces;
//         libs
//         (
//             "libsampling.so"
//             "libpostProcess.so"
//         );
//         writeControl    adjustableRunTime;
// 	    writeInterval   0.0001;
//         region fluid;

//         surfaceFormat   raw;
//         fields          (interfaceEnergyFluxLiquid interfaceEnergyFluxGas);

//         interpolationScheme cell;

//         surfaces
//         (

//             freeSurf
//             {
//                 type            interface;
//                 interpolate     false;
//             }

//         );
//     }

//     intPsi
//     {
//         type            fieldIntegrate;
//         libs ("libpostProcess.so");

//         // Write at same frequency as fields
//         writeControl    timeStep;
//         writeInterval   1;
//         region fluid;
//         field psi0_;
//     }

// }

// ************************************************************************* //
